{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Metadata listing implemented features, related files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Reference file providing prewritten summaries for key frontend source files.",
  "frontend/index.css": "Global Tailwind CSS setup defining warm OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that loads the React app into the root element.",
  "frontend/src/App.tsx": "Main React component composing all marketing sections and passing centralized content into each.",
  "frontend/src/components/marketing/Footer.tsx": "Footer displaying business branding, owner name, and a small attribution section.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "Simple about section with a title and descriptive paragraph centered on the page.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Contact section showing phone, email, address, hours, and a non-functional demo contact form.",
  "frontend/src/components/marketing/sections/GallerySection.tsx": "Gallery grid displaying images with hover zoom effects in a responsive layout.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Renders a hero section with background image, business info, tagline, and scroll-to-contact/menu buttons.",
  "frontend/src/components/marketing/sections/MenuSection.tsx": "Displays a menu grid of items with name, price, and description using card components.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Shows customer testimonials in a card grid with quotes and names.",
  "frontend/src/components/marketing/sections/WhyChooseUsSection.tsx": "Lists business highlights in a card grid with icons and descriptions.",
  "frontend/src/components/marketing/TopNav.tsx": "Responsive navigation bar with scroll-based styling and anchor link navigation for all page sections.",
  "frontend/src/content/rajFoodyContent.ts": "Provides static content configuration for Raj Foody, including hero data, menu, highlights, gallery, testimonials, and contact details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login, logout, and login states.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting no backend queries are needed yet.",
  "frontend/src/index.css": "Defines Tailwind base styles and a warm color palette for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s current state, required images, and feature list for building the Raj Foody website."
}